---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.BumpmapDepth
source: html/c90852c4-6c40-9b2d-025b-e625d9476131.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.BumpmapDepth Property

The property labeled "Amount" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string BumpmapDepth { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".